In [1]:
#Demographics Analyzer
import pandas as pd

#Read file
df = pd.read_csv('adult.data.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [6]:
#Counting the number of each race
race_count = df.value_counts(subset=['race'], sort=True)
race_count

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: count, dtype: int64

In [7]:
#Calculating the average age of men
male = df.loc[df['sex'] == 'Male']
age_male = male['age']
age_count = age_male.value_counts()
age_count = age_count.reset_index()
age_count['wt_age'] = age_count['age']*age_count['count']
average_age_men = age_count['wt_age'].sum()/len(male)

In [14]:
male = df.loc[df.sex == 'Male']
male_age_count = male.age.value_counts().reset_index()
male_age_count['age_weight'] = male_age_count.age * male_age_count['count']
male_age_count

    age  count  age_weight
0    35    630       22050
1    34    629       21386
2    37    629       23273
3    33    620       20460
4    36    611       21996
..  ...    ...         ...
67   84      6         504
68   83      5         415
69   85      2         170
70   88      2         176
71   87      1          87

[72 rows x 3 columns]

In [15]:
avg_age_men = male_age_count.age_weight.sum() / len(male)
avg_age_men

39.43354749885268

In [ ]:
c_count = df.value_counts('native-country')
sal_plus = df.loc[df['salary'].isin(['>50K'])]
countries_plus = sal_plus['native-country']
cp_count = countries_plus.value_counts()
compare = pd.concat([c_count, cp_count], axis=1)
compare.columns = ['c_count','cp_count']
ratio = compare['cp_count']/compare['c_count']
highest_earning_country = ratio.idxmax()
highest_earning_country_percentage = 100*ratio.max()

In [17]:
people_per_country = df.value_counts('native-country')
salary_over_50k = df.loc[df.salary.isin(['>50K'])]
over_50k_per_country = salary_over_50k.value_counts('native-country')

comparison = pd.concat([people_per_country, over_50k_per_country], axis=1)
comparison.columns = ['total', 'over_50k']
ratios = comparison.over_50k / comparison.total
highest_earning_country = ratios.idxmax()
highest_earning_country_percentage = ratios.max() * 100

In [18]:
highest_earning_country

'Iran'

In [19]:
highest_earning_country_percentage

41.86046511627907